Repository: OmegaT-L10N/ar
Catalog: omegat/project_save.tmx
Source language: en
Languages: ar

source: --ITokenizer=<classname> --ITokenizerTarget=<classname> Source- or target-language tokenizer to use (overrides project settings).
ar: --ITokenizer=<classname> --ITokenizerTarget=<classname> محلل مفردات اللغة المصدر أو الهدف الواجب استخدامه (يلغي إعدادات المشروع).

source: --config-file=<path> A Java .properties file from which to load default settings.
ar: --config-file=<مسار> ملف خصائص جافا .properties لتحميل الإعدادات الافتراضية.

source: --disable-location-save Do not remember the last directory opened in the file picker.
ar: --disable-location-save لا تتذكر آخر مجلد مفتوح في مستكشف الملفات.

source: --disable-project-locking Do not attempt to lock the project's omegat.project file.
ar: --disable-project-locking لا تحاول إيصاد ملف المشروع omegat.project.

source: --mode=[console-translate|console-pseudotranslatetmx|console-align] Specify a mode other than default (GUI).
ar: --mode=[console-translate|console-pseudotranslatetmx|console-align] لتحديد نمط آخر غير النمط الافتراضي (واجهة المستخدم الرسومية).

source: --no-team Disable team project functionality.
ar: --no-team ألغ وظيفة المشروع الجماعي.

source: --remote-project Download an omegat.project file from the URL given as <project path> and load the project.
ar: --remote-project أنزل ملف omegat.project عبر العنوان المحدد في <project path> وحمّل المشروع.

source: --resource-bundle=<path> A Java .properties file to use for interface text --config-dir=<path> The directory to read/write OmegaT configuration files from/to.
ar: --resource-bundle=<مسار> ملف خصائص جافا .properties للاطلاع على نص الواجهة --config-dir=<مسار> المجلد المخصص لقراءة/كتابة ملفات تهيئة أوميجاتي من/إلى.

source: --script=<path> A script file to be executed on project events.
ar: --script=<مسار> ملف سكربت يُنَفَّذ أثناء أحداث متعلقة بالمشروع.

source: -h, --help Show usage information.
ar: -h, --help عرض معلومات الاستخدام.

source: Invoke `team -h` for details.
ar: استدع `team -h` للاطلاع على التفاصيل.

source: Non-GUI mode options: --quiet Reduce output to command line stdout.
ar: خيارات نمط الاستخدام بدون واجهة رسومية: --quiet تقليص الخرج المُوجَّه للإخراج المعياري لسطر الأوامر.

source: OmegaT
ar: أوميجاتي

source: Options: None: Launch GUI Project path only: Launch GUI and load specified project team Team project tool.
ar: خيارات: None: أطلق واجهة المستخدم الرسومية Project path only: أطلق واجهة المستخدم الرسومية وحمّل مشروعاً معيناً team أداة المشاريع الجماعية.

source: See OmegaT.jar/META-INF/MANIFEST.MF for valid values.
ar: انظر OmegaT.jar/META-INF/MANIFEST.MF للاطلاع على القيم الصالحة.

source: See below for details.
ar: انظر أدناه للاطلاع على التفاصيل.

source: Usage: java -jar OmegaT.jar [<options>] [<project path>]
ar: الاستخدام: java -jar OmegaT.jar [<خيارات>] [<مسار المشروع>]
